import numpy as np
from pandas import DataFrame

from MathProtEnergyProcAug.DatasGenerate import GenerateRandomDatasInDiapasonsFrame

import unittest


# Модульные тесты
class TestGenerateRandomDatasInDiapasonsFrame(unittest.TestCase):
    def setUp(self):
        # Выполнить настройку тестов (если необходимо)
        pass

    def tearDown(self):
        # Выполнить завершающие действия (если необходимо)
        pass

    # Модульные тесты
    def testGenerateRandomDatasInDiapasonsFrame1(self):
        # Исходные данные
        borderValues = [[1.1, 2.2, 5.5, 7.7],
                        [4.1, 3.2, 6.5, 9.7],
                        [6.3, 2.3, 4.5, 5.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [2.7, 2.1, 3.3, 9.3],
                        [6.7, 5.1, 6.3, 9.7],
                        [1.1, 5.4, 2.8, 1.1],
                        [2.1, 7.4, 5.8, 4.1],
                        [7.8, 6.9, 1.2, 2.3],
                        [8.8, 7.9, 4.2, 6.3]]
        nPoints = [5, 10, 7, 3, 2]
        namesValues = ["val1", "val2", "val5", "val7"]  # Имена величин

        # Создаем фрейм величин
        borderValues = DataFrame(borderValues,
                                 columns=namesValues)

        # Преобразованные матрицы
        minValuesAll = [[1.1, 2.2, 5.5, 7.7],
                        [1.1, 2.2, 5.5, 7.7],
                        [1.1, 2.2, 5.5, 7.7],
                        [1.1, 2.2, 5.5, 7.7],
                        [1.1, 2.2, 5.5, 7.7],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [6.3, 2.3, 4.5, 5.5],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [2.7, 2.1, 3.3, 9.3],
                        [1.1, 5.4, 2.8, 1.1],
                        [1.1, 5.4, 2.8, 1.1],
                        [1.1, 5.4, 2.8, 1.1],
                        [7.8, 6.9, 1.2, 2.3],
                        [7.8, 6.9, 1.2, 2.3]]
        maxValuesAll = [[4.1, 3.2, 6.5, 9.7],
                        [4.1, 3.2, 6.5, 9.7],
                        [4.1, 3.2, 6.5, 9.7],
                        [4.1, 3.2, 6.5, 9.7],
                        [4.1, 3.2, 6.5, 9.7],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [8.3, 4.3, 8.5, 6.5],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [6.7, 5.1, 6.3, 9.7],
                        [2.1, 7.4, 5.8, 4.1],
                        [2.1, 7.4, 5.8, 4.1],
                        [2.1, 7.4, 5.8, 4.1],
                        [8.8, 7.9, 4.2, 6.3],
                        [8.8, 7.9, 4.2, 6.3]]

        # Генерируем случайные данные
        rndDatas = GenerateRandomDatasInDiapasonsFrame(borderValues,  # Границы генерируемых величин
                                                       nPoints  # Числа точек в соответствующих диапазонах
                                                       )

        # Проверяем значения
        self.assertEqual(list(rndDatas), namesValues)
        self.assertTrue(np.all(rndDatas.to_numpy() < maxValuesAll))
        self.assertTrue(np.all(rndDatas.to_numpy() >= minValuesAll))

    def testGenerateRandomDatasInDiapasonsFrame2(self):
        # Исходные данные
        borderValues = [[1.1, 1.2, 4.5],
                        [3.1, 3.2, 6.5],
                        [5.3, 1.3, 3.5],
                        [8.3, 2.3, 8.5],
                        [1.7, 1.1, 1.3],
                        [6.7, 5.1, 5.3],
                        [2.1, 3.4, 1.8],
                        [2.3, 7.4, 5.8],
                        [4.8, 2.9, 0.2],
                        [9.8, 7.9, 7.2]]
        nPoints = [6, 14, 5, 6, 1]
        namesValues = ["val1", "val3", "val4"]  # Имена величин

        # Создаем фрейм величин
        borderValues = DataFrame(borderValues,
                                 columns=namesValues)

        # Преобразованные матрицы
        minValuesAll = [[1.1, 1.2, 4.5],
                        [1.1, 1.2, 4.5],
                        [1.1, 1.2, 4.5],
                        [1.1, 1.2, 4.5],
                        [1.1, 1.2, 4.5],
                        [1.1, 1.2, 4.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [5.3, 1.3, 3.5],
                        [1.7, 1.1, 1.3],
                        [1.7, 1.1, 1.3],
                        [1.7, 1.1, 1.3],
                        [1.7, 1.1, 1.3],
                        [1.7, 1.1, 1.3],
                        [2.1, 3.4, 1.8],
                        [2.1, 3.4, 1.8],
                        [2.1, 3.4, 1.8],
                        [2.1, 3.4, 1.8],
                        [2.1, 3.4, 1.8],
                        [2.1, 3.4, 1.8],
                        [4.8, 2.9, 0.2]]
        maxValuesAll = [[3.1, 3.2, 6.5],
                        [3.1, 3.2, 6.5],
                        [3.1, 3.2, 6.5],
                        [3.1, 3.2, 6.5],
                        [3.1, 3.2, 6.5],
                        [3.1, 3.2, 6.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [8.3, 2.3, 8.5],
                        [6.7, 5.1, 5.3],
                        [6.7, 5.1, 5.3],
                        [6.7, 5.1, 5.3],
                        [6.7, 5.1, 5.3],
                        [6.7, 5.1, 5.3],
                        [2.3, 7.4, 5.8],
                        [2.3, 7.4, 5.8],
                        [2.3, 7.4, 5.8],
                        [2.3, 7.4, 5.8],
                        [2.3, 7.4, 5.8],
                        [2.3, 7.4, 5.8],
                        [9.8, 7.9, 7.2]]

        # Генерируем случайные данные
        rndDatas = GenerateRandomDatasInDiapasonsFrame(borderValues,  # Границы генерируемых величин
                                                       nPoints  # Числа точек в соответствующих диапазонах
                                                       )

        # Проверяем значения
        self.assertEqual(list(rndDatas), namesValues)
        self.assertTrue(np.all(rndDatas.to_numpy() < maxValuesAll))
        self.assertTrue(np.all(rndDatas.to_numpy() >= minValuesAll))

    def testGenerateRandomDatasInDiapasonsFrame3(self):
        # Исходные данные
        borderValues = [[3.1, 2.2, 5.5, 7.7, 10.1],
                        [4.7, 3.2, 6.5, 8.7, 14.6],
                        [5.1, 2.3, 4.5, 4.5, 11.3],
                        [9.3, 4.3, 8.5, 7.5, 20.1],
                        [3.5, 2.1, 3.3, 6.3, 13.5],
                        [7.7, 5.1, 6.3, 8.7, 27.3]]
        nPoints = [3, 2, 5]
        namesValues = ["val2", "val3", "val5", "val8", "val15"]  # Имена величин

        # Создаем фрейм величин
        borderValues = DataFrame(borderValues,
                                 columns=namesValues)

        # Преобразованные матрицы
        minValuesAll = [[3.1, 2.2, 5.5, 7.7, 10.1],
                        [3.1, 2.2, 5.5, 7.7, 10.1],
                        [3.1, 2.2, 5.5, 7.7, 10.1],
                        [5.1, 2.3, 4.5, 4.5, 11.3],
                        [5.1, 2.3, 4.5, 4.5, 11.3],
                        [3.5, 2.1, 3.3, 6.3, 13.5],
                        [3.5, 2.1, 3.3, 6.3, 13.5],
                        [3.5, 2.1, 3.3, 6.3, 13.5],
                        [3.5, 2.1, 3.3, 6.3, 13.5],
                        [3.5, 2.1, 3.3, 6.3, 13.5]]
        maxValuesAll = [[4.7, 3.2, 6.5, 8.7, 14.6],
                        [4.7, 3.2, 6.5, 8.7, 14.6],
                        [4.7, 3.2, 6.5, 8.7, 14.6],
                        [9.3, 4.3, 8.5, 7.5, 20.1],
                        [9.3, 4.3, 8.5, 7.5, 20.1],
                        [7.7, 5.1, 6.3, 8.7, 27.3],
                        [7.7, 5.1, 6.3, 8.7, 27.3],
                        [7.7, 5.1, 6.3, 8.7, 27.3],
                        [7.7, 5.1, 6.3, 8.7, 27.3],
                        [7.7, 5.1, 6.3, 8.7, 27.3]]

        # Генерируем случайные данные
        rndDatas = GenerateRandomDatasInDiapasonsFrame(borderValues,  # Границы генерируемых величин
                                                       nPoints  # Числа точек в соответствующих диапазонах
                                                       )

        # Проверяем значения
        self.assertEqual(list(rndDatas), namesValues)
        self.assertTrue(np.all(rndDatas.to_numpy() < maxValuesAll))
        self.assertTrue(np.all(rndDatas.to_numpy() >= minValuesAll))


# Запустить тестирование
if __name__ == "__main__":
    unittest.main()
